header = '''Форма:\n"
#define %Оценка% %степень овладения[Эксперт(4)/Хорошо(3)/Средне(2)/Новичок(1)/Интересует(0)]%
- %название% :[!-%Оценка% for Практика] [ #-%Оценка% for Теория] [\"Примечание\"]

Пример:

----------------------------------------------------------------------------------------------------------
- SQL                                                 : !-2 #-3 "Stepik SQL course"                      |
  ^                                                  ^   ^   ^   ^               ^                       |
  |                                                  |   |   |   |               |                       |
  Название ------------------------------------------    |   |    ----- Примечание                       | 
                                                  Практика   Теория                                      |
----------------------------------------------------------------------------------------------------------

Мои умения:

'''

footer = '''----------------------------------------------------------------------------------------------------------

Мои интересы:

- Computer vision
- Machine learning
- Neural networks
- AI
- Roboticts
- Web security
- Low-level architecture
'''


logic_split = "----------------------------------------------------------------------------------------------------------\n"

file_in = open("Резюме_raw.txt", "r+")
file_out = open("Резюме.txt", "w+")


arr = [x.split(':') for x in file_in.readlines()]

file_out.write(header)

for line in arr:
	if(line[0][0] == '-'):
		file_out.write(logic_split)
	file_out.write("{:50s}{:55s}|\n".format(line[0], line[1].strip('\n')))

file_out.write(footer)

file_in.close()
file_out.close()